{"_id": "Bidaud.Consequences", "coauthors": "", "email": "", "firstname": "A.", "institution": "", "lastname": "Bidaud", "references": "", "text": "\nIn 2003, the report « The Economics of Reprocessing vs. Direct Disposal of Spent Nuclear Fuel » was issued. The authors made a detailed comparison of the cost of various options of fuel reprocessing. It is based on a major review of existing literrature and uses systematically sensitivity analyses and Monte Carlo methods to estimate the robustness of the model and conclusions to assumptions. It is one of the most cited work in the field. The authors made very clear that even with overwelmingly favorable assumptions, the reprocessing option wheter in PWR or in FR would be uneconomic in a very wide range of input hypothesis. In this presentation we will show that an error was made in the estimation of the annual loading of blankets for the model with Fast Breeder Reactors. Calculation was done as if the blankets were producing 100% of the power of the reactor when they usually produce less than 10%. This errors multiplies by more than ten the need for blanket fuel fabrication and reprocessing which has a very adverse effect on the global economic equation of Fast Breeder Aeactors. The authors made their most important calculation sheets available on the internet which allows transparency and the reproduction and the correction of the results. We will present corrected versions of the key figures of the report together with some alternative conclusions. This error demonstrates the needs for open benchmarks and active forums where experts can check the robustness of their interdisciplinary tools. It also demonstrates that the debate about the opportunity of advanced fuel cycle is much more open than that report demonstrated.This refocuses the debate on the key technical-economics assumptions in favor of the different options. What is the cost-benefit analysis of blankets in SFR ? Is uranium price or visibility of its potential reduced availability of any relevance to the debate ? How are the uncertainties in the costs of advanced fuel cycles fuzzing the debate ? Are economical arguements of any use for actual decision making regarding fuel cycle questions or even energy issues ?\n", "timestamp": "", "title": "Consequences of a calculation an error in Harvard’s report on The Economics of Reprocessing vs. Direct Disposal of Spent Nuclear Fuel\n"}
{"_id": "Chvala.Fuel", "coauthors": "Gavin Ridley", "email": "ochvala@utk.edu", "firstname": "Ondrej", "institution": "University of Tennessee at Knoxville", "lastname": "Chvala", "references": "", "text": "Denatured molten salt reactors (DMSR) fueled by low-enriched uranium are an example of molten salt reactor technology considered closer to market due to relative simplicity. DMSR concepts with limiter fuel processing are currently pursued by several commercial vendors.  We developed a method for reactivity and chemistry control of these systems by LEU and reducer additions over expected core lifetime. This method was also applied to DMSR started with actinides from DMSR spent fuel in order to achieve a novel sustained fuel cycle with limited resource needs. LWR spent fuel was also used as a starting point in this strategy, which represents a fuel cycle transition scenario from LWR to DMSR systems. The talk would present major findings concerning material flows and fuel needs in both the cases.\n", "timestamp": "5/4/2017 13:27:47", "title": "Fuel cycle of LEU-fueled denatured molten salt reactor"}
{"_id": "Clavel.Uncertainties", "coauthors": "", "email": "jean-baptiste.clavel@irsn.fr", "firstname": "Jean-Baptiste", "institution": "IRSN (Institut de Radioprotection et de Sûreté Nucléaire)", "lastname": "Clavel", "references": "", "text": "The definition of electronuclear scenarios is often done with the aim to evaluate strategies of reactors deployments and new options of fuel management. Those scenarios contain a huge number of input parameters (reactors, facilities, storages and stocks characteristics, nuclear fleet progress…) which are not always precisely define and are often uncontrolled, like the loading factor or the starting date of reactors. Those uncertainties might have a strong impact on some output quantities such as inventories compositions, plutonium/waste masses. This paper aims at testing an uncertainties and sensitivities method that should be used for robust studies applied to scenarios framework.\nThe proposed approach starts by selecting parameters, defining uncertainties models (Gaussian, uniform...) and variation ranges. The results of the uncertainty propagation also depend on the evaluated quantities of interest, therefore the observables on which the impact will be estimated must be selected. Once this setup is defined, the next step is to apply a screening method (Morris design) to evaluate the significance and interactivity of parameters on the results. This allows evaluating independent parameters apart. Finally, a sensitivity study based on the evaluation of Sobol indices is applied on the remaining parameters for deeper analyse.\nThe Dynamic fuel cycle simulation tool used for this illustration is CLASS (Core Library for Advance Scenario Simulation) [1, 2], which is an open source package of C++ libraries developed by CNRS in collaboration with IRSN. For this paper, the CLASS software is coupled with the Promethee computer experiments workbench developed at IRSN [3]. It provides an easy-to-use graphical interface for parametric calculations and integrates several algorithms including the Morris and Sobol ones allowing for advanced sensitivity studies. This method will be presented on a simple application case using these tools.\n", "timestamp": "4/10/2017 4:33:52", "title": "Uncertainties and sensitivities study methods applied to the dynamic fuel cycle "}
{"_id": "Dixon.Simulation", "coauthors": "", "email": "brent.dixon@inl.gov", "firstname": "Brent", "institution": "Idaho National Laboratory", "lastname": "Dixon", "references": "[1] Brown, N.R., B.W. Carlsen, B.W. Dixon, B. Feng, H.R. Greenberg, R.D. Hays, S. Passerini, M. Todosow, A. Worrall, “Identification of fuel cycle simulator functionalities for analysis of transition to a new fuel cycle”, Annals of Nuclear Energy 96 (2016) 88-95, 2016.\n[2] Feng, B., B. Dixon, E. Sunny, A. Cuadra, J. Jacobson, N.R. Brown, J. Powers, A. Worrall, S. Passerini, R. Gregg, “Standardized verification of fuel cycle modeling”, Annals of Nuclear Energy 94 (2016) 300-312, 2016.\n[3] Guerin, L., B. Feng, P. Hajzlar, B. Forget, M.S. Kazimi, L. Van Den Durpel, A. Yacout, T. Taiwo, B.W. Dixon, G. Matthern, L. Boucher, M Delpech, R. Girieud, M. Meyer, “A Benchmark Study of Computer Codes for System Analysis of the Nuclear Fuel Cycle”, Center for Advanced Nuclear Energy Systems, Massachusetts Institute of Technology, MIT-NRC-TR-105, April 2009.\n[4] “Benchmark Study on Nuclear Fuel Cycle Transition Scenarios Analysis Codes”, Expert Group on Fuel Cycle Transition Scenario Studies, Nuclear Energy Agency, NEA/NSC/WPFC/DOC(2012)16, Paris, June 2012.\n[5] “Framework for Assessing Dynamic Nuclear Energy Systems for Sustainability: Final Report of the INPRO Collaborative Project GAINS”, International Atomic Energy Agency, NP-T-1.14, Vienna, 2013.\n[6] Gidden, M., Scopatz, A., Wilson, P., “Developing standardized, open benchmarks and a corresponding specification language for the simulation of dynamic fuel cycle”, Trans. Am. Nucl. Soc. 108, 127–130, 2013.\n", "text": "All developers of fuel cycle simulation tools have needed to grapple with the difficulty of verifying their performance.  While individual equations can be checked for accuracy, the performance of the code as a whole is more difficult.  Typical techniques range from running highly simplified models that can be manually verified to cross-comparison with other codes that have themselves been verified through similar means.  Newer codes can also be verified against benchmarks and other results previously generated by established codes.\n\nThis presentation will discuss a number of the previous activities that have been undertaken to verify the performance of fuel cycle simulation tools, including unit tests [1], code-to-code comparisons [2], and a number of international benchmarking efforts [3,4,5].  The short presentation will summarize each of these efforts, including the approach, the tests or scenarios considered, codes evaluated, and other information as a lead-in to a general discussion on code verification and the potential for building a library of unit tests and benchmark cases.  The presenter has been involved with all of these previous activities referenced here and will provide first-person information on the processes used and general lessons learned.  This presentation may be paired with the proposed presentation of Bo Feng, “Valuable Lessons from Fuel Cycle Code Comparisons” and would also benefit from a brief presentation by Anthony Scopatz on material on developing standardized benchmarks [6].\n", "timestamp": "4/17/2017 12:07:52", "title": "Simulation Tool Benchmarking and Verification"}
{"_id": "Dixon.Visualization", "coauthors": "", "email": "brent.dixon@inl.gov", "firstname": "Brent", "institution": "Idaho National Laboratory", "lastname": "Dixon", "references": "", "text": "This presentation will discuss some of the types of outputs of dynamic nuclear fuel cycle simulations that been represented graphically and the reasons for presenting the data in different ways.  The range of analyses and output types will include initiation, transition, equilibrium, material isotopics, a range of specific and normalized metrics, equilibrium and dynamic economics parameters, verification parameters, breakouts by reactor type, fuel type, etc., uncertainty analyses, sensitivity analyses, and others.  Examples of standardized output templates used on analyses involving multiple codes and scenarios will also be provided as examples of the typical range of outputs expected.  The presentation will also include some graphics developed post-analysis to enhance the explanation of code behavior and results, including drivers for differences between codes in benchmarks.  Examples will be drawn from published reports of national and international fuel cycle studies and solicitation of experienced practitioners.\n\nThis presentation should help underpin the importance of visualization and the classes that are needed to support code development and verification, scenario development, assumption sensitivity assessment, assessment of uncertainty, and presentation of results to peers, the technical community, and decision makers.  The intent is to support a general discussion on visualization needs for fuel cycle simulation.", "timestamp": "6/12/2017 12:07:52", "title": "Visualization of Simulation Results"}
{"_id": "ERNOULT.A", "coauthors": "DOLIGEZ Xavier, ZAKARI-ISSOUFOU Abdoul-Aziz, SOMAINI Alice", "email": "ernoult@ipno.in2p3.fr", "firstname": "Marc", "institution": "CNRS/IPNO", "lastname": "ERNOULT", "references": "", "text": "Sodium cooled Fast Reactors (SFR) are present in a lot of scenarios and strategies for the future of nuclear energy. They often constitutes a large part of future nuclear reactor fleets, sometimes up to 100%. It is thus important to include model for these reactors in our codes. However the deployment of SFRs at the industrial scale has not started yet and concept are not completely fixed. A wide range of design are still currently studied, some are at a more advanced technology readiness level and seems to  be more close to industrial reactors, but no consensus yet on one of them.\nTo conclude about the scenarios including these reactor concepts we need models inside our scenario codes, models precises enough to render to sensitivity of isotopes' inventories to changes of designs and/or fuel cycle. Creating one model for each design and then testing all scenarios with all models would be  unnecessarily  time consuming considering how far most sodium fast reactors concepts are from industrial technology readiness levels.\nTo avoid this problem while still providing a model precise enough to be able to conclude on the scenarios involving SFRs, we choose to develop a single, physics-based, flexible model able to represent a wide range of SFR designs. In  this flexible model many design parameters, such as the radius or the height of the active core or the fertile blankets, are not fixed but can be chosen during scenario definition in order to adapt the SFR design in each scenario while still using the unique model.\nThe model is integrated in the CLASS scenario simulation tool[1] and is based on neural networks able to feed the two main CLASS sub-models that are the cross-section predictor and the fuel building method. For the cross-section predictor, cross-section for a large collection of SFR depletion that are representative of the whole range of simulated designs are needed. For  the fuel building method, even in breeder reactor, and due to the difficulty to control reactivity in SFR, the evolution of K during depletion is the limiting factor for choosing what material to put in your fuel. Therefor we need also to be able to predict k evolution for the whole collection of SFR designs.\nThe influence of a wide range of parameters and modeling choices on the cross-sections and the k have been investigated and only most  significant parameters are used for the final simulations.\nBecause the construction of a training base for neural network needs a big number of point, we used also these calculations to simplify as much as possible the model use for neural network training without sacrificing behavior rendering and precision.\nUsing these parameter selection as a training base for the neural networks, a model is created and included in the scenario code CLASS. Some reference scenarios are then simulated using this model are analyzed in order to assess the level of flexibility and precision of the model.", "timestamp": "5/2/2017 10:49:46", "title": "A global and flexible model for Sodium-cooled Fast Reactors in electro-nuclear scenarios"}
{"_id": "Feng.Valuable", "coauthors": "", "email": "bofeng@anl.gov", "firstname": "Bo", "institution": "Argonne National Laboratory", "lastname": "Feng", "references": "", "text": "Numerous nuclear fuel cycle system code benchmarks and comparisons have been performed over the last decade, coinciding with the rapid development of new codes due to improvements in computational capabilities, new software platforms, and the need for various institutions to provide technical feedback on potential fuel cycle strategies and policies. Many of these studies were performed within the framework of established international organizations or organized as an ad hoc study with voluntary contributions from participants. These studies achieved different levels of agreement depending on the scenarios analyzed and values compared, varying from excellent agreement in annual mass flows and inventories to general agreement in terms of trends. Since validation is challenging for these types of codes, these comparison studies helped develop confidence in the results from these forecasting codes. In addition, many of these codes were developed independently with limited feedback due to the lack of a widely-established user base. Therefore, such studies are also great opportunities for the developers and users to calibrate interpretations as well as modify/debug the codes themselves.\n\nHowever, in almost all of these benchmarks and code comparisons, the same challenges and discrepancies keep re-appearing, and may continue to be “re-discovered” through future benchmarks. Therefore, this presentation is an effort to document such similarities and valuable lessons learned from these exercises so that future verification studies can focus on comparing more advanced capabilities and features rather than on these expected fundamental differences. The author presents some of the key lessons that he has observed through his participation in various code comparisons and benchmarks with the goal of stimulating discussion and encouraging the community to be aware of expected differences between codes. Some of the valuable lessons to be discussed include: 1) most of the differences in code results were not due to different code algorithms or calculation approaches, but due to different interpretations of the input specifications among the analysts, 2) the first specifications will almost never be the final version and will almost always require being iteratively updated with preliminary results from codes, 3) different codes often report or account for mass inventories at different times within a given year or even time-step that often lead to differences that are misleading, 4) for more complex scenarios, all codes may need to make approximations at one level or another (in the input or modeling of mass flows), and others.", "timestamp": "4/4/2017 7:52:36", "title": "Valuable Lessons from Fuel Cycle Code Comparisons"}
{"_id": "Hays.Fuel", "coauthors": "", "email": "ross.hays@inl.gov", "firstname": "Ross", "institution": "Idaho National Laboratory", "lastname": "Hays", "references": "", "text": "A persistent challenge in the development of any computational model is the proper application of complexity to capture the desired outcomes with the necessary fidelity without incurring undue costs.  Certain models track individual fuel batches through individual reactors using embedded neutronics calculations to closely estimate isotopic mass flows in time.  While others simply assume that reactors of a given type have fixed-isotopic input and output fuel recipes.  Most fall somewhere in between; it is also common for powerful codes to be applied simply at first for fast scoping calculations, with advanced features reserved for later application to the more promising options.\nA recent series of analyses using the VISION fuel cycle model followed such an arc.  The initial scenario to be examined relied on an equilibrium fuel recipe at a pre-calculated end-state, requiring very little sophistication.  Later scenarios examined the transition to the end state from an assumed starting point.  The first calculations required only the existing ability to evolve between similar fuel recipes.  However, later transitions looked at swapping out breeder reactor driver, blanket, and reflector assemblies to vary the breeding ratio.  This introduced large changes in core mass and irradiation time parameters, which VISION was unable to handle.  To compute this scenario, changes were made to the reactor fuel management module to increase its flexibility.  Instead of tracking mass, this new model tracks the integer number of reactors having fuel at 1) a given point burn-up, 2) the pass index of the fuel, and 3) the fuel recipe vintage (where vintage refers to either the Current or Previous recipe).  When the recipe for a reactor changed, the previously loaded inventory is transferred over from the Current vintage to the Previous.  The previous recipe fuel is then prioritized for discharge ahead of the newer material, ensuring a timely transition.  This allows the recipe transition to occur without requiring a complete restart of the affected reactor fleet.\nAnother common challenge is that of adapting existing models to unforeseen situations.  For example, while the continuous fuel flow of the VISION fleet-averaged model would be readily adaptable to the continuous refueling of a Pebble Bed Reactor, it would be quite a different undertaking to model a Molten Salt Reactor.  In the former case, the constant rate of new fuel addition and old fuel discharge would be well matched to the existing constant-flow approximations.  However, in the latter case, the requirement that fuel pass through finite cooling, processing, and fabrication stages would introduce an unavoidable logical delay.  While shortening the timestep might improve the fidelity of the calculations, it would do so at a large computational cost.  Other work-arounds may be possible, but their impacts to scenario fidelity must be carefully assessed prior to deployment.", "timestamp": "4/25/2017 11:45:35", "title": "Fuel Composition Transition Modeling"}
{"_id": "Huff.Discussion", "coauthors": "Scopatz, Flanagan, Bae", "email": "kdhuff@illinois.edu", "firstname": "Kathryn", "institution": "University of Illinois", "lastname": "Huff", "references": "", "text": "I think it could be fruitful to have a discussion about algorithms for driving deployment based on demand (not just of power, but of fuel materials, reprocessing capacity, etc) in each of the existing simulators. This, clearly, is in line with the Demand Driven Cycamore Archetypes NEUP proposal. Anyway, based on the literature review we'll be presenting at global, I'd be happy to give a talk and/or just lead some discussion to have everyone discuss how or whether they handle this challenge in their various simulators. ", "timestamp": "5/3/2017 15:38:40", "title": "Discussion on Driving Deployment with Demand"}
{"_id": "Krivtchik.Scenarios", "coauthors": "", "email": "guillaume.krivtchik@gmail.com", "firstname": "Guillaume", "institution": "CEA (France)", "lastname": "Krivtchik", "references": "", "text": "Since 1985, the CEA/DEN has been developing the COSI software, simulating the dynamic evolution of a reactor fleet and its associated facilities. It was validated on the French historical PWR fleet, and participated in several benchmarks including NEA.\n\nCOSI6 performs reactor-driven, continuous time scenario simulations. Many fuel cycle facilities are modeled, with different levels of detail, from the uranium mines to the final waste. In particular, the fuel batches, the reactors and the reprocessing plants are highly parameterized, so as to provide an accurate model of the fuel cycle. In addition, the consumption of non-fissile, strategical / critical materials of interest, such as boron, can be evaluated so as to compare the needs and the resources.\n\nThis presentation focuses on the newly implemented optimization and uncertainty propagation techniques, and provides insight on the limits of both processes, thus requiring the development of innovative scenario generation and analysis methods.\n\nA multicriteria scenario optimization method using COSI6 was developed. This method uses metaheuristics and a surrogate sub-model approach in the frame of widely multiparameter and non-linear optimization studies. The general steps of the methods will be exposed, as well as examples of transition scenarios optimization. The feedback from recent studies will be analyzed and limits and perspectives will be discussed.\n\nThe uncertainty propagation method will be developed, including categorization of uncertainty sources, cross-sections covariance matrices collapsing, uncertainty propagation in depletion and equivalence models, as well as examples of uncertainty propagation. Once again, the physical and philosophical limits of the process will be discussed.\n\nFinally, the concept of robustness in scenario studies will be discussed. This topic still is an open question, and the ways to tackle it must be discussed. Different perspectives of robustness characterization and optimization will be exposed. ", "timestamp": "3/31/2017 2:48:15", "title": "Scenarios with COSI6: Optimization, Uncertainty and Beyond"}
{"_id": "Mouginot.Confidence", "coauthors": "", "email": "", "firstname": "Baptiste", "institution": "", "lastname": "Mouginot", "references": "", "text": "As fuel cycle simulation tools aims to simulate prospective nuclear fuel cycles, and because of the sensitivity of the actual nuclear fuel cycle data, it is extremely difficult to establish confidence in any single tool without a new major code comparison project. Uncertainties associated with fuel cycle modeling such as costs, time-frames, and physics of alternative technologies often make the validation of simulation results complicated. Classical code comparisons and benchmarks have generally suffered from an inability to compare results between  simulators due to differences in modeling choices and output data [1-2]. Currently, different institutions are developing their own numerical tools regarding their scientific objective. These tools may have several different philosophies and thus cannot answer all the relevant issues of future nuclear fuel cycle. One partial solution, to resolve this shortcoming within the community, will be to build a general and universal framework dedicated to the validation of simulation tools. Within this framework, we a better understanding of the main sources of uncertainty and comparison obstacles could be achieved, There are three main sources of uncertainty that affect most fuel cycle simulations:\nApproximation and hypothesis modeling non-existent reactors/fuels.\nFundamental data uncertainties that propagate through the fuel cycle simulation to the output.\nA wide range of input variables and parameters are possible, and this can strongly impact the result of a scenario simulation.\nWhile points 1. and 2. are already being investigated by fuel cycle tool developers in other research frameworks, this work aims to address point 3.\nUsing sensitivity analysis (SA) formalism will help in both understanding and improving the weight of input variables and parameters via evaluating output standard deviations. In the framework of this open collaboration, we aim to build a set of experiments composed by a set of subtasks of growing complexity. This allows each component of a fuel cycle tool to be evaluated in depth. The experiments will be concluded with an SA on the full problem, yield a deeper understanding of the constraints and limits of a specific tool. The ability within the framework to compare results with other fuel cycle tool calculations will provide clearer requirements of certain tool-specific features to  explain/understand some behaviors. This first experiment has been designed as a simple test case to assess the correlation of a once-through cycle composed of an enrichment facility, a PWR loaded with UOX fuel, and a storage facility for used UOX fuel. Both CLASS[3] results and Cyclus[4] results and their comparison will be presented.", "timestamp": "", "title": "Confidence Improvement Effort"}
{"_id": "Mouginot.Model", "coauthors": "P.P.H. Wilson", "email": "mouginot@wisc.edu", "firstname": "Baptiste", "institution": "University of Wisconsin-Madison", "lastname": "Mouginot", "references": "[1] B. MOUGINOT, “cyCLASS: CLASS models for Cyclus,”, Figshare, https://dx.doi.org/10.6084/m9.figshare.3468671.v2 (2016).\n[2] B. Mouginot, P.P.H. Wilson, R.W. Carlsen, “Impact of Isotope Fidelity on Fuel Cycle Calculations”, ANS Winter Conference, Las Vegas, (November 2016)\n[3] B. Leniau, B. Mouginot, N. Thiollière, X. Doligez, A. Bidaud, F. Courtin, M. Ernoult and S. David, “A neural network approach for burn-up calculation and its application to the dynamic fuel cycle code CLASS,” Annals of Nuclear Energy , 81 , 125 – 133 (2015).\n[4] B. Leniau, F. Courtin, B. Mouginot, N. Thiollière, X. Doligez, A. Bidaud, “Generation of SFR Physics Models for the Nuclear Fuel Cycle Code CLASS” PHYSOR 2016\n", "text": "The CLASS team has developed high quality predictors based on pre-trained neural networks, allowing the estimation the evolution different neutronic parameters, such as neutron multiplication factor or macroscopic cross sections, along the irradiation of the fuel. This allows building various fuel fabrication and depletion models for fuel cycle simulators. The cyCLASS package [1]  has been developed to allow the use of CLASS  fabrication and cross section prediction models inside Cyclus. cyCLASS provides a reactor facility and a fuel fabrication facility, which are able to use any CLASS models to provide/request fuel to the entire Cyclus ecosystem. Using cyCLASS, it has been possible to perform fuel cycle simulations comparing different levels of archetypes fidelity[2].\n\nThis work focuses on the analysis of the performance of some high fidelity models developed from [3,4], extending the isotopic validity space from uranium and plutonium to the most common transuranic elements for Light Water Reactors (LWR) and Sodium Fast Reactors (SFR). Those extended models were required to study a transition scenario from the actual US nuclear fleet to a SFR and LWR fleet reprocessing the most commun transuranic elements (see “Recipe vs Model” presentation from the same author). The present work aims to evaluate the following for each of the models:\nthe performance relative to the training sample density,\nthe precision topography inside and outside of the validity space,\nthe performance of the burnup calculation for the cross section predictors.\nAs a complete set of real data is not available to benchmark such models, their relative performances will be evaluated with regards to the depletion tool used to train them.\n", "timestamp": "5/5/2017 13:15:59", "title": "Model Performance Analysis"}
{"_id": "Peterson-Droogh.Cross", "coauthors": "Eva Davidson and Robbie Gregg", "email": "petersonjl@ornl.gov", "firstname": "Joshua", "institution": "Oak Ridge National Laboratory", "lastname": "Peterson-Droogh", "references": "[1] Wigeland, R., et al. (October 8, 2014). Nuclear Fuel Cycle Evaluation and Screening - Final Report. FCRD-FCO-2014-000106. US DOE.\n[2] R. Gregg, (October 2014) ORION User Guide –V4 Draft Issue 7.  IMS_T_REP v.10 ", "text": "When modeling fuel cycle transitions, it is important to accurately capture the changes in radionuclide inventory of spent fuel at discharged as they can vary significantly from their associated steady-state conditions.  Two methods for calculating the radionuclide inventory of discharged spent fuel for fuel cycle analysis includes using pre-calculated recipes and using cross sections.\n\nRecipes are tabulated sets of feed and discharge compositions for a given fuel irradiation history. They provide the “transfer coefficients” that fuel cycle simulators need to convert mass flow radionuclide compositions for the feed fuel of a reactor into the mass flow radionuclide compositions of fuel discharged from the reactor. Recipes are calculated ahead of time using neutronics tools and then are input directly into the fuel cycle model. Although this approach works well for modeling fuel cycles with a fixed input and output composition (e.g., once-through LEU fuel cycles and simple single recycle scenarios) or fuel cycles already at equilibrium when compositions do not very significantly, it is difficult to accurately model more complex scenarios involving isotopic changes that occur during transition and on the approach to equilibrium. This includes changing from one fuel type to another or from one fuel cycle approach to another, such as transitioning from the current U.S. LWR fleet to a fleet of sodium fast cooled reactors.\n\nUsing problem-specific cross-section libraries generated by neutronics depletion tools is the second method for calculating the radionuclide inventory of discharged spent fuel for fuel cycle analysis. Unlike the recipes approach, the output stream in the reactor model is dynamic and changes based on input stream radionuclide composition. Another advantage of using cross-section libraries within fuel cycle evaluation codes is that some fuel cycle simulators can perform on the fly cross-section interpolation routines that generate reactor-, cycle-, and scenario-specific production and destruction routes during the fuel cycle calculation. This provides a means to capture the effects of changes in the neutron flux spectrum and magnitude of isotopic concentrations and cross sections during in-core irradiation.\n\nStaff at ORNL has produced burnup-dependent cross-section libraries that can be used for the fuel cycles being evaluated in the DOE FCO campaign [1] including cross sections for thermal reactors (CANDU, BWR, PWR, MOX, MSR) and fast reactors (SFR).  These cross sections have been used in ORION, a nuclear fuel cycle simulator developed at NNL [2]. It will be demonstrated with ORION that though recipes work well for static systems such as once-through fuel cycle models and steady-state scenarios, cross sections provide a higher fidelity results that can capture changes in more dynamic systems such as complex scenarios involving the multi-reuse and isotopic changes that occur during the transition and on the approach to equilibrium.", "timestamp": "4/13/2017 14:50:49", "title": "Cross section versus recipes for fuel cycle transition analysis using ORION"}
{"_id": "Shuller-Nickles.Energize:", "coauthors": "Matthew Boyer, Michael Carbajales-Dale, Stephen Moysey, Frances Smith, Robert Bickhart, Megan Hoover, Alexander Hanna", "email": "lshulle@clemson.edu", "firstname": "Lindsay", "institution": "Clemson University", "lastname": "Shuller-Nickles", "references": "", "text": "The public has an ever-increasing interest in the economic, environmental, and social impacts of the global energy production. To support informed decision making, the scientific community has a responsibility to communicate reliable and straightforward information to the general public, in an engaging way, regarding energy systems and how choices made at different stages of an energy technology life cycle can impact the cost, amount of materials used, and waste produced. Our objective is to enhance public engagement via an interactive electrical energy game through which users can interact with one another in their quest to develop an electrical energy portfolio that optimizes economic (e.g., company profit), environmental (e.g., reduced CO2 emissions), and social (e.g., public opinion) impacts. Individual users will be introduced to the simulation environment as follows: “Congratulations on your new appointment as the CEO for [generic energy company]. As CEO, your goal is to maintain balance of your key metrics …. Best of luck!” Each player is given an existing power plant portfolio, expected electricity demand, and prompted to start taking action. Particular emphasis will be placed on the nuclear fuel cycle, comparing different fuel cycle technologies using the data from the DOE Nuclear Fuel Cycle Options Catalog.\n\nThe development of the Energize game is two-fold: 1. Accurate and quantifiable modeling of electrical energy systems and 2. Engaging and interactive user interface within the construct of the game narrative. Research efforts are underway in both the front end (game narrative) and back end (system modeling) aspects of our energy simulator. The VenSim modeling software is used for construction of our initial back-end models. The water resources game Naranpur provides a baseline for many of the Energize game mechanics, as well as a platform upon which to configure our energy systems models within the construct of a game interface. An initial focus group was used to gain insight into user interactions with Naranpur and found that emphasis on the visual depiction of the game is key for grabbing user attention. Further, users vary in the quantity of information desired during game play. Here we present the overall game narrative, initial user interface and pose the question: “How much is too much?” Can users experience information overload, leading to indifference with the game interface?", "timestamp": "5/3/2017 15:21:05", "title": "Energize: An interactive evaluation tool for engaging the general public with energy decision making"}
{"_id": "Skutnik.Integrating", "coauthors": "", "email": "sskutnik@utk.edu", "firstname": "Steve", "institution": "", "lastname": "Skutnik", "references": "", "text": "Given the inherently dynamic nature of used fuel isotopic vectors resulting from reactor irradiation, the use of recipe-based approaches to isotopic tracking for fuel cycle scenario can become untenable under certain recycle-based scenarios. This effect is especially significant for material recycle back to thermal-spectrum reactors, which exhibit a more pronounced sensitivity of discharge isotopic compositions as a function of input isotopic vector.\n\nThus, two key questions that should be addressed in fuel cycle simulation are, 1) How can we appropriately incorporate physics into reactor-based depletion for fuel cycle scenario analysis, and 2) When are these effects significant (and when can they be adequately neglected?) Thus, a key goal of this discussion will be to identify strategies for how to incorporate physics information into fuel cycle simulations and under what circumstances it contributes significantly to evaluation of fuel cycle metrics of interest.", "timestamp": "5/3/2017 16:14:12", "title": "Integrating Physics-Based Depletion into Fuel Cycle Simulation: When, How, and Why"}
{"_id": "Thiolliere.Study", "coauthors": "Fanny Courtin", "email": "nicolas.thiolliere@subatech.in2p3.fr", "firstname": "Nicolas", "institution": "Subatech", "lastname": "Thiolliere", "references": "", "text": "Dynamic fuel cycle simulation codes model evolving nuclear fuel cycles, and calculate nuclides inventories and material flows in each unit of the cycle. In the nuclear fuel cycle simulation code CLASS (Core Library for Advanced Scenario Simulation), a Fuel Loading Model (FLM) builds a fresh fuel fulfilling the reactor criticality requirement, depending on the available fissile material. Then, a mean cross-sections predictor calculates the mean cross-sections required to perform the fuel depletion in a short calculation time. This contribution presents the elaboration of these models in the case of a PWR- MOXEUS fuel (MOX on Enriched Uranium Support), which allows plutonium mono-recycling and multi-recycling in PWR. These models are built using neural networks. These predictors are trained on a databank composed of 1000 PWR infinite assembly depletion calculations performed using the software MURE (MCNP Utility for Reactor Evolution) based on the transport code MCNP (Monte- Carlo N Particle). A scenario in which PWR MOXEUS models are also tested on a balancing scenario is presented. The complex evolution of MOXEUS fresh fuel isotopic composition during the scenario is highlighted. Finally, a sensitivity studies based on a set of fuel cycle simulations performed from a precise design of experiment has been done. This work shows preliminary results for plutonium stabilization and incineration capabilities in a fuel cycle composed by PWR.\n", "timestamp": "4/28/2017 7:51:52", "title": "Study of plutonium reprocessing in PWR with the CLASS tool"}
{"_id": "Tillard.Preliminary", "coauthors": "", "email": "lea.tillard@irsn.fr", "firstname": "Léa", "institution": "IRSN (Institut de Radioprotection et de Sûreté Nucléaire)", "lastname": "Tillard", "references": "", "text": "Regarding the evolution of the electronuclear fleet for the next years, the French reference scenario [1, 2] considers the progressive deployment of low void effect Sodium Fast Reactor (SFR-CFV), a generation IV reactor. The implementation of this new reactor in the CLASS (Core Library for Advanced Scenario Simulation) software, a dynamic fuel cycle simulation code developed by CNRS in collaboration with IRSN, requires the development of specific physics models [3]. These models aim at predicting physical quantities such as multiplication factor, cross sections, flux or isotopic compositions. These predictors are used many times during the simulation. First, they are used to build fresh fuel according to the reactor characteristics. For instance, in case of reprocessing scenario, fresh fuel might be manufactured with any isotopic composition present into storages. Besides, these predictors are also used to calculate the depletion of all possible fuel compositions. Thus, they must be optimized on a criterion of computing time minimization while providing sufficiently accurate results. Therefore, predictors’ development is based on a databank composed of many depletion Monte Carlo simulations.\nIn this framework, prior to developing these predictors a neutronic study of each reactor core design is needed to determine the behavior of the quantities of interest, such as cross sections. Thus, physics models are adapted to reactor specificities. For practical reasons, they are generally based on a simplified version of the reactor design and the impact of different simplifications on neutronic values has to be quantified.\nThis introductory paper presents one ASTRID-like SFR-CFV preliminary study that is currently performed before integrating the associated models into the CLASS code. The low sodium void effect core used is based on the 600 MWe French ASTRID concept developed by CEA with industrial partners [4]. The core, which is very heterogeneous, is composed of two radial parts: an inner and an outer core. There are two kinds of assemblies which alternate differently fertile and fissile areas.\nTo prepare the appropriate methodology for core simulations, infinite assembly calculations can be run. First of all, static and depletion Monte Carlo codes are used to adjust different quantities of interest (number of cycles, number of particles per cycle, number of time steps…). Then, the impact of the fuel isotopic composition on the previous indicators must be evaluated. These Monte Carlo simulations are done with the MORET Monte Carlo code and the coupling between MORET code and VESTA software, both developed by IRSN. The main results and analysis will be presented in the proposed paper.", "timestamp": "4/10/2017 4:41:35", "title": "Preliminary studies for ASTRID-like SFR implementation in the CLASS code"}
{"_id": "Tillement.Between", "coauthors": "", "email": "Stephanie.Tillement@mines-nantes.fr", "firstname": "Stéphanie", "institution": "", "lastname": "Tillement", "references": "[1] S. Tillement. Electronuclear and socio-economic scenarios: building Generation IV nuclear power plants decision-making processes, Techincal Workshop: Nuclear Fuel Cycle, Paris, 2016.\n[2] S. Tillement, B. Journé, N. Thiolliere et B. Mouginot. Le choix des réacteurs du futur: échelles de temps des scénarios électronucléaires, In Le nucléaire au prisme du temps, Presses des Mines, 2015.", "text": "This paper is based on an interdisciplinary research (social sciences & physics) conducted in the framework of PrISE (Interdisciplinary research project on Electronuclear Scenarios) funded by French NEEDS program. In the continuity of research collaborations initiated in 2014, this project questions the link between scenario (especially electronuclear scenario), and decision-making processes, in the French case. More precisely, we aim at as a tool and a collective process, and, at the scientific, technological and perhaps more importantly political decisions regarding nuclear power and more broadly energy production. Indeed, the implication of the political sphere in the construction and evaluation of scenario and their relationships with communities of practices involved in scenario-making (industrials, academics…) were ‘blind spots’ of previous researches (Tillement et al., 2015, Tillement, 2016). To address this question, we adopt an original methodology based on the organization of focus-groups. In contrast to traditional methods in social sciences, focus-groups enable to structure collective discussions on a specific topic. For now, we organized three focus-groups gathering representatives of three different communities of practices, involved, more or less directly, in scenario- and decision-making processes: 1) “Politics”; 2) “Engineering and Industry”; 3) “Academics”. From the analysis of these focus-groups, we propose in this communication to consider the scenario as a “boundary object” (Star, 2010) that sometimes helps to cross inter-occcupational boundaries and sometimes reinforce those boundaries. On the one hand, scenarios supports knowledge transfers and translation between communities of practices and appears flexible enough to enable different groups to work together without prior consensus or shared goals. On the other hand, scenarios can be ‘instrumentalised’ to serve one particular message or built in a way that makes them very ‘opaque’ or too complex to support any decisions. In these last cases, scenarios rather tend to reinforce boundaries. The political arena in particular appears very far from scenarios and political decisions do not seem motivated by scenarios, for cognitive as well as strategic reason. We conclude with some limitations and avenues for future research.", "timestamp": "7/12/2017 11:16:35", "title": "Between heterogeneity and cooperation: the (electronuclear)scenario as a ‘boundary object’ for decision-making?"}
{"_id": "Villacorta Skarbeli.Analysis", "coauthors": "", "email": "aris.villacorta@ciemat.es", "firstname": "Aris", "institution": "CIEMAT", "lastname": "Villacorta Skarbeli", "references": "", "text": "Reprocessing of irradiated nuclear fuel serves multiple purposes, from Pu separation and recovery for MOX fuel fabrication to reduction of high level waste volume, and is nowadays being implemented in several countries like France, Japan or Russia, having a significant number of nuclear power plants and installed capacity. This work is aimed at exploring the possibility (in resources and economic terms) of implementing reprocessing for MOX fabrication in countries with medium sized fleets.\n\nIn order to properly study this reprocessing strategy in a medium sized fleet, the case of Spain has been chosen as representative. Two groups of fuel cycle scenarios beyond the current status of the fuel cycle in this country have been simulated. They include life-extension of the current reactor fleet and reprocessing strategies that burn the maximum possible amount of the Pu mass generated in the cycle. The simulation of the scenarios has been performed with TR_EVOL code developed at CIEMAT, considering each Spanish nuclear reactor individually.\n\nThis work includes the assessment of the impact of different scenario hypotheses on the amount of Pu burned in the cycle, the gallery length required in the final disposal, the economic implications (for the fuel cycle and in the particular case of reprocessing and waste management), and the effect of variations in the price of natural uranium.\n\nResults show that the lifetime of the reactors has an impact in the possible reduction in the Pu amount. Besides, some scenarios show a shortage of Pu available for MOX fuel fabrication coming from the reprocessing of UO2 spent fuel. From the economics point of view, this work has verified that, for medium sized fuel cycle scenarios, the most important parameters are the reprocessing cost and the natural uranium price. Smaller impact in the comparison is also found for the cost of the final disposal and the possibility of valuing the surplus Pu and reprocessed uranium existing at the end of the cycle.", "timestamp": "4/3/2017 2:52:46", "title": "Analysis of reprocessing options for medium sized nuclear fleets"}
{"_id": "mouginot.Recipe", "coauthors": "P.P.H. Wilson", "email": "", "firstname": "Baptiste", "institution": "", "lastname": "Mouginot", "references": "", "text": "The U.S. Department of Energy (DOE) Fuel Cycle Options (FCO) campaign has chartered studies to assess the future of the U.S. nuclear fleet using different criteria, e.g., nuclear waste management, resource utilization, and environmental impact. In the Evaluation and Screening phase [1], only equilibrium scenarios were considered for fuel cycles that were regarded as representative of a set of similar fuel cycle concepts. Each set of concepts represents a so-called Evaluation Group (EG). This work is based on a transition from the actual US nuclear fleet (EG01) to a steady state scenario of EG30. EG30 is a closed double strata scenario with light water and fast reactors. On one stratum, sodium fast reactors (SFRs) recycle their own transuranium elements (TRU). The SFRs also recycle the TRU produced by light water reactors (LWRs), which comprise the other stratum. The SFRs employ a blanket filled with natural uranium. The TRU produced by the SFR blanket is diluted with natural uranium to build the MOX fuel used in the LWRs. During the transition, both SFRs and LWRs are able to use low enriched uranium as a startup fuel. The TRU from the blanket can also been used as a filler to build the SFR MOX if needed.\n\nThis study aims to compare the transition calculation of a fixed deployment schedule performed with a recipe-based approach against one that employs in-simulation fuel fabrication and depletion modelisation. Both calculations were performed with the Cyclus fuel cycle simulator [2]. The recipe-based approach required fixed material flows (the transition batches correspond to a mix between the TRU from both the SFR recycled fuel and the SFR blanket), as well as 5 consecutive reprocessing passes to reach equilibrium with regards to the SFR. In contrast the in-simulation modeling scenario features mixing of the different material streams according to their availability and the reactor requirements. This means that depletion calculations are performed for each loaded fuel set. These models have been specially computed based on the previous CLASS models [3,4]. The two different calculations will be compared, specially in term of transition speed, unused plutonium inventories, and loaded fuel composition.", "timestamp": "", "title": "Recipe vs. Model"}
{"_id": "Wojtaszek.Scenario", "coauthors": "", "email": "daniel.wojtaszek@cnl.ca", "firstname": "Dan", "institution": "Canadian Nuclear Laboratories", "lastname": "Wojtaszek", "references": "", "text": "Thorium-based fuel cycles offer many potential benefits, including greater long-term energy sustainability, and improved waste management characteristics, along with comparable economics relative to uranium-based fuels.  Analytical studies of thorium-based fuel cycle deployment strategies can help determine the optimal approaches for a given thorium fuel cycle, and guide fuel cycle technology research and development.\n\nThe purpose of this study was to analyze the potential impacts on the management of used nuclear fuel (UNF) associated with deploying thorium-based fuels in Pressure Tube Heavy Water Reactors (PT‑HWRs) in a once through fuel cycle.  The fuels that were analyzed are:\n\n·       a reference low-burnup (~7.2 MWd/kg) natural uranium (NU) fuel,\n\n·       an intermediate-burnup (~19.1 MWd/kg) fuel composed of 1.2 wt.% 235U/U slightly enriched uranium (SEU) combined with small amounts of thorium (95 wt.% SEU, 5 wt.% Th).\n\n·       a high-burnup  (~40.6 MWd/kg) fuel composed of 5.0 wt.% 235U/U low enriched uranium (LEU) mixed with thorium (~48 wt.% LEU, ~52 wt.% Th).\n\nThe scenario involves the deployment of these fuels in a fleet of PT‑HWRs, with a total installed capacity equal to that of all PT‑HWRs in Canada in 2014 (~13,512 MWe (net)), for a period of 60 years.  All UNF is to be ultimately placed in a deep geological repository (DGR) that is similar to the Canadian DGR concept for all PT‑HWR UNF in Canada.  Any UNF that has been removed from wet storage was temporarily placed in dry storage until it could be sent to the DGR.\n\nThe UNF management metrics that were analyzed include:\n\n·       the number of MACSTOR dry storage fuel baskets required to store UNF that has been removed from wet storage, but cannot be immediately loaded into the DGR; and\n\n·       the number of Canadian DGR used fuel containers (UFCs) loaded with UNF.\n\nThese metrics reflect the cost and footprint of the respective UNF management facilities.  In this analysis the total amount of UNF that can be placed in either a dry storage fuel basket or a DGR UFC cannot exceed a given number of fuel bundles and a maximum total decay power.\n\nThe results of this analysis show that the NU fuel required the fewest dry storage baskets due to its low decay power relative to the other fuels.  The intermediate -burnup SEU+Th fuel required the fewest number of DGR UFCs.  The high-burnup LEU+Th fuel also required fewer DGR UFCs than the NU fuel.", "timestamp": "4/11/2017 13:37:18", "title": "Scenario Analysis of PT‑HWR Used Fuel Management for Once-Through Thorium Fuel Cycles"}
{"_id": "ZAKARI-ISSOUFOU.A", "coauthors": "N. Thiollière, X. Doligez, M. Ernoult, A. Somaini, F. Courtin, A. Bideau", "email": "zakari@ipno.in2p3.fr", "firstname": "Abdoul-Aziz", "institution": "CNRS", "lastname": "ZAKARI-ISSOUFOU", "references": "", "text": "In nuclear scenarios the use of mixed oxide (MOx) fuel usually involves a long term strategy toward fast reactors that should guarantee a natural resource resistant nuclear power. While MOx fuel are often presented as a possibility to gather progressively the fissile materials needed for theses reactors, many questions remain. As an example, either fast reactors come to start or not the final situation should be bearable in term of waste toxicity (including plutonium in the worst case). In a prospective study, there is no one solution to such an issue but more likely a tendency as a lot of parameters (cooling time, fuel burn-up, fraction of MOx fuelled reactors…) has to be considered.\n\nIn order to cope with this problematic, a new scenario methodology has been developed. Each scenario is defined by a set of parameters. Typically, it is the composition of the fleet (rector number, power share…), the characteristics of the fuel (UOx, MOx, MOxAm) or reactors (burn-up, loading factor…) and the options of the fuel cycle (Cooling time of spent fuel, Storage, reprocessing strategy…). The exercise consists in an “all at a time” method where all the parameters of the scenario are modified together via a random sampling (Latin Hypercube Sampling, there is no two identical set of parameters) and then run with the CLASS (Core Library for Advanced Scenario Simulations) code.\n\nIn this workshop, we will present our methodology for the multivariate analysis and the major results will be discussed.", "timestamp": "5/3/2017 8:08:40", "title": "A Mutlivariate Analysis of Mixed Oxide Based Nuclear Scenarios"}
